#Дана матрица А размером 7 × 5 и массив В размером 5. Заменить максимальный
# элемент столбца соответствующим элементом массива В, если этот элемент
# больше найденного максимального элемента столбца. В противном случае замены
# не производить
A = [[1, 2, 3, 4, 5],
    [6, 7, 8, 9, 10],
    [11, 12, 13, 14, 15],
    [16, 17, 18, 19, 20],
    [21, 22, 2, 24, 25],
    [26, 27, 2, 29, 30],
    [3, 32, 3, 3, 35]]

B = [30, 16, 22, 31, 18]
for j in range(5):
    max_val = A[0][j]
    max_idx = 0
    for i in range(1, 7):
        if A[i][j] > max_val:
            max_val = A[i][j]
            max_idx = i
    if B[j] > max_val:
        A[max_idx][j] = B[j]
for i in range (len(A)):
    print(A[i])
